In [5]:
#importing pandas
import pandas as pd

In [30]:
#importing jeopardy CSV
df = pd.read_csv('jeopardy.csv')
df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,2004-12-31,Jeopardy!,HISTORY,$200,"For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",Copernicus
1,4680,2004-12-31,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,$200,"No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves",Jim Thorpe
2,4680,2004-12-31,Jeopardy!,EVERYBODY TALKS ABOUT IT...,$200,"The city of Yuma in this state has a record average of 4,055 hours of sunshine each year",Arizona
3,4680,2004-12-31,Jeopardy!,THE COMPANY LINE,$200,"In 1963, live on ""The Art Linkletter Show"", this company served its billionth burger",McDonald's
4,4680,2004-12-31,Jeopardy!,EPITAPHS & TRIBUTES,$200,"Signer of the Dec. of Indep., framer of the Constitution of Mass., second President of the United States",John Adams

In [41]:
#changing column names (there is extra space in the beginning)
list(df.columns)
df.rename(columns = {'Show Number': 'Show Number',
 ' Air Date': 'Air Date',
 ' Round': 'Round',
 ' Category': 'Category',
 ' Value': 'Value',
 ' Question': 'Question',
 ' Answer': 'Answer'}, inplace = True)
list(df.columns)

['Show Number', 'Air Date', 'Round', 'Category', 'Value', 'Question', 'Answer']

In [42]:
#finding the questions that contain either 'King' or 'England'
def words_finder(dataframe, words):
    finder = lambda x : all(word.lower() in x.lower() for word in words)
    return dataframe.loc[dataframe['Question'].apply(finder)]

king_england = words_finder(df, ['King', 'England'])

print(king_england)

        Show Number    Air Date             Round               Category  \
4953    3003         1997-09-24  Double Jeopardy!  "PH"UN WORDS
6337    3517         1999-12-14  Double Jeopardy!  Y1K
9191    3907         2001-09-04  Double Jeopardy!  WON THE BATTLE
11710   2903         1997-03-26  Double Jeopardy!  BRITISH MONARCHS
13454   4726         2005-03-07  Jeopardy!         A NUMBER FROM 1 TO 10
...      ...                ...        ...                           ...
208295  4621         2004-10-11  Jeopardy!         THE VIKINGS
208742  4863         2005-11-02  Double Jeopardy!  BEFORE & AFTER
213870  5856         2010-02-15  Double Jeopardy!  URANUS
216021  1881         1992-11-09  Double Jeopardy!  HISTORIC NAMES
216789  5070         2006-09-29  Double Jeopardy!  ANCIENT HISTORY

         Value  \
4953    $200
6337    $800
9191    $800
11710   $600
13454   $1000
...       ...
208295  $600
208742  $3,000
213870  $1600
216021  $1000
216789  $1200

                                                                                                      Question  \
4953    Both England's King George V & FDR put their stamp of approval on this "King of Hobbies"
6337    In retaliation for Viking raids, this "Unready" king of England attacks Norse areas of the Isle of Man
9191    This king of England beat the odds to trounce the French in the 1415 Battle of Agincourt
11710   This Scotsman, the first Stuart king of England, was called "The Wisest Fool in Christendom"
13454   It's the number that followed the last king of England named William
...                                                                      ...
208295  In 1066 this great-great grandson of Rollo made what some call the last Viking invasion of England
208742  Dutch-born king who ruled England jointly with Mary II & is a tasty New Zealand fish
213870  In 1781 William Herschel discovered Uranus & initially named it after this king of England
216021  His nickname was "Bertie", but he used this name & number when he became king of England in 1901
216789  This kingdom of England grew from 2 settlements, one founded around 495 by Cerdic & his son Cynric

                              Answer
4953    Philately (stamp collecting)
6337    Ethelred
9191    Henry V
11710   James I
13454   4
...    ..
208295  William the Conqueror
208742  William of Orange roughy
213870  George III
216021  Edward VII
216789  Wessex

[152 rows x 7 columns]

In [51]:
#Adding a column that has the values in floats and removing extra $ sign and ','
df['Value Finder'] = df['Value'].apply(lambda x: float(x[1:].replace(',','')) if x != 'None' else 0)

#Mean value of questions in category 'HISTORY'
history = df[df['Category'] == 'HISTORY']
history['Value Finder'].mean()

603.7249283667621

In [62]:
#Counting answers with 'King' or 'England'
def get_answer_counts(dataframe):
    return dataframe["Answer"].value_counts()

print(get_answer_counts(king_england))

William the Conqueror       6
Edward                      3
Oliver Cromwell             3
James I                     3
Richard the Lionhearted     3
                           ..
Duke of Windsor             1
William of Orange roughy    1
"the Merry Monarch"         1
3                           1
William III                 1
Name: Answer, Length: 114, dtype: int64